/******************************************************************************
 Software License Agreement:

 The software supplied herewith by Microchip Technology Incorporated
 (the "Company") for its PICmicro(r) Microcontroller is intended and
 supplied to you, the Company's customer, for use solely and
 exclusively on Microchip PICmicro Microcontroller products. The
 software is owned by the Company and/or its supplier, and is
 protected under applicable copyright laws. All rights are reserved.
 Any use in violation of the foregoing restrictions may subject the
 user to criminal sanctions under applicable laws, as well as to
 civil liability for the breach of the terms and conditions of this
 license.

 THIS SOFTWARE IS PROVIDED IN AN "AS IS" CONDITION. NO WARRANTIES,
 WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
********************************************************************/
#include <xc.h>
#include "mcc/mcc.h"
#include "bt_app.h"
#include "bt_command_send.h"
#include "bt_command_decode.h"
#include "ble.h"
#include "timer.h"
#include "yda174dsp_handler.h"
#include "line_in.h"

//===============================================
//  VARIABLES CLAIM
//===============================================
// @ bluetooth task state define
enum {
    BT_STATE_INITIALIZE_START = 0,
    BT_STATE_INIT_MFB_HIGH,
    BT_STATE_INIT_RESET_HIGH,
    BT_STATE_INIT_RESET_HIGH_WAIT,
    BT_STATE_INIT_COMMAND_START,    //send first command
    BT_STATE_INIT_SETUP_GPIO,
    BT_STATE_INIT_WAIT_GPIO_EVENT,
    BT_STATE_INIT_READ_DEVICE_ADDR,
    BT_STATE_INIT_READ_DEVICE_ADDR_WAIT,
	BT_STATE_INIT_READ_DEVICE_NAME,
	BT_STATE_INIT_READ_DEVICE_NAME_WAIT,
	BT_STATE_INIT_READ_5506_FEATURE,
	BT_STATE_INIT_READ_5506_FEATURE_WAIT,
    BT_STATE_INIT_BLE_ADV_START,
	BT_STATE_INIT_BLE_ADV_WAIT,

    BT_STATE_POWER_ON_START,        //wait 500ms. after 500ms, send SYSTEM_ON and CSB_PAGE command
    BT_STATE_POWER_ON_BUTTON_PRESSED,
    BT_STATE_POWER_ON,          //system on finished, wait for BT or AUX instruction
    BT_STATE_BLE_ADV_WAIT,
    BT_STATE_VOL_SYNC,
	BT_STATE_INIT_NSPK_STATUS,
	BT_STATE_INIT_NSPK_STATUS_WAIT,    
    BT_STATE_READ_PAIR_RECORD,
    BT_STATE_READ_PAIR_RECORD_WAIT,
    BT_STATE_READ_LINKED_MODE,
    BT_STATE_READ_LINKED_MODE_WAIT,
    BT_STATE_LINKBACK_START,
    BT_STATE_LINKBACK_TO_LAST_DEVICE,
    BT_STATE_BT_RUNNING,

    BT_STATE_POWER_OFF_START,
    BT_STATE_POWER_OFF_START_NSPK,
    BT_STATE_POWER_OFF_WAIT,
    BT_STATE_POWER_OFF_WAIT_NSPK,
    BT_STATE_POWER_OFF_WAIT2,
    BT_STATE_POWER_OFF_WAIT2_NSPK,
    BT_STATE_POWER_OFF_WAIT_NSPK_EVENT,
    BT_STATE_POWER_OFF
} BTAPP_TaskState;

static uint8_t BTAPP_Request;

uint16_t BTAPP_timer1ms;
uint16_t BTEQ_timer1ms;
uint16_t BTMute_timer1ms;

uint8_t BTEQ_SendIndex;
uint8_t BTEQ_RecIndex;

uint8_t BTEQ_Debug;
uint8_t BT_LinkStatus;          // link status

typedef struct {
    uint8_t LinkedProfileStatus;
    uint8_t DeviceID_LinkIndex;
} CONNECTION_STATUS;
#define CONNECTION_MAX 3
struct {
    uint8_t activeIndex;
    CONNECTION_STATUS allConnection[CONNECTION_MAX];
} BT_AllConnections;

enum {
    BT_LINKBACK_INIT,       //init
    BT_LINKBACK_CONNECTING, //sent link_back command but no event yet
    BT_LINKBACK_OK,         //link back success, event
    BT_LINKBACK_FAILED,     //linkback failed, event
    BT_PAIRING_START,       //sent pair command but no event yet
    BT_PAIRING,             //pair event
    BT_PAIRING_OK,          //pair event
    BT_PAIRING_FAILED,      //pair event
    BT_LINK_CONNECTED,         //other event
} BT_LinkbackStatus;       // linkback status

enum BT_NSPK_LINK_STATUS {
    BT_NSPK_NO_LINK = 0,
    BT_NSPK_MASTER_LINK_TO_SLAVE2 = 1,
    BT_NSPK_MASTER_LINK_TO_SLAVE3 = 2,
    BT_NSPK_MASTER_LINK_TO_BOTH = 3,
    BT_NSPK_SLAVE_LINK_TO_MASTER = 4,
    BT_BROADCAST_MASTER = 5,
    BT_BROADCAST_SLAVE = 6
};
enum BT_NSPK_EVENT {
    BT_CSB_EVENT_STANDBY = 0,
    BT_CSB_EVENT_BUSY = 1,
    BT_CSB_EVENT_CONNECTING = 2,
    BT_CSB_EVENT_CONNECTED = 3,
    BT_CSB_EVENT_LOSS = 4,
    BT_NSPK_EVENT_BACK_TO_MASTER = 5,
    BT_NSPK_EVENT_BACK_TO_SLAVE = 6,
    BT_CSB_EVENT_CHANGE_ROLE = 7,
    BT_CSB_EVENT_DISCONNECTED_BY_NFC = 8,
    BT_CSB_EVENT_CONTINUE_CONNECTING = 9
};
enum BT_NSPK_SYSTEM_STATUS {
    BT_CSB_STATUS_STANDBY = 0,
    BT_CSB_STATUS_CONNECTING,
    BT_CSB_STATUS_CONNECTED_AS_NSPK_MASTER,
    BT_CSB_STATUS_CONNECTED_AS_NSPK_SLAVE,
    BT_CSB_STATUS_NSPK_MASTER_CONNECTING,
    BT_CSB_STATUS_CONNECTED_AS_BROADCAST_MASTER,
    BT_CSB_STATUS_CONNECTED_AS_BROADCAST_SLAVE,
    BT_CSB_STATUS_BROADCAST_MASTER_CONNECTING,
};
struct {
    enum BT_NSPK_LINK_STATUS nspk_link;
    enum BT_NSPK_EVENT snpk_event;
    enum BT_NSPK_SYSTEM_STATUS  nspk_status;
} BT_eCSBStatus;

//@
enum {
    BT_CALL_IDLE = 0,
    BT_VOICE_DIAL = 1,
    BT_CALL_INCOMMING = 2,
    BT_CALL_OUTGOING = 3,
    BT_CALLING = 4,
    BT_CALLING_WAITING = 5,
    BT_CALLING_HOLD = 6
} BT_CallStatus;
//@
enum {
    LINE_IN_INACTIVE = 0,
    LINE_IN_ACTIVE,
    LINE_IN_ACTIVE_WITH_AUDIO,
    LINE_IN_WITH_SILENCE_AUDIO
} LineInStatus;
//@
enum {
    BT_A2DP_IDLE = 0,
    BT_A2DP_ACTIVE = 1
} BT_A2DPStatus;
//@
enum {
    BT_PLAYING_STOPPED,
    BT_PLAYING_PLAYING,
    BT_PLAYING_PAUSED,
    BT_PLAYING_FF,
    BT_PLAYING_FR,
    BT_PLAYING_ERROR
} BT_PlayingStatus;

uint8_t BT_pairedRecordNumber;
extern uint8_t BT_linkIndex;
uint8_t BT_linkedMode;
uint8_t BT_nSPKLinkedCounter;
//some flags
union{
    uint16_t value;
    struct {
        uint16_t updateA2DPGainReq           : 1;
        uint16_t updateHFPGainReq            : 1;
        uint16_t updateLineInGainReq         : 1;
        uint16_t linkbackToDevAddr           : 1;
        uint16_t musicCtrlReq_00             : 1;
        uint16_t musicCtrlReq_01             : 1;
        uint16_t musicCtrlReq_03             : 1;
        uint16_t musicCtrlReq_07             : 1;
        uint16_t SPPLinkBackReq              : 1;
    };
} NextCommandReq;

union{
    uint16_t value;
    struct {
        uint16_t SpeakerAddCommandReq        : 1;       //0xE2(NSPK)
        uint16_t BroadcastModeCommandReq     : 1;       //0xE2(broadcast)
        uint16_t NSpeakerTriggerMasterReq    : 1;       //0xE0
        uint16_t NSpeakerTriggerSlaveReq     : 1;       //0xE1
        uint16_t BroadcastTriggerMasterReq   : 1;       //0xE0
        uint16_t BroadcastTriggerSlaveReq    : 1;       //0xE1
        uint16_t PairReq                    : 1;        //ANY_MODE_ENTERING_PAIRING
        uint16_t ResetEEPROMReq             : 1;        //RESET_EEPROM_SETTING
        uint16_t NextSongReq                : 1;        //NEXT_SONG
        uint16_t PreviousSongReq            : 1;        //PREVIOUS_SONG
        uint16_t IncSpkGainReq              : 1;        //INC_SPK_GAIN
        uint16_t DecSpkGainReq              : 1;        //DEC_SPK_GAIN
        uint16_t AcceptCallReq              : 1;        //ACCEPT_CALL
        uint16_t ForceEndCallReq            : 1;        //FORCE_END_CALL
        uint16_t LastNumberRedialReq        : 1;        //LAST_NUMBER_REDIAL
        uint16_t RejectCallReq              : 1;        //REJECT_CALL
    };
} NextMMIActionReq;

union{
    uint16_t value;
    struct {
        uint16_t TransferCallReq            : 1;        //0x0E
        uint16_t VoiceDialReq               : 1;        //0x0A
        uint16_t cancelVoiceDialReq         : 1;        //0x0B
        uint16_t PlayPauseReq               : 1;        //0x32
        uint16_t CancelNSPKReq              : 1;        //0xE3
        uint16_t TerminateNSPKReq           : 1;        //0xE4
        uint16_t TerminateCancelNSPKReq     : 1;        //0xE5
        uint16_t switchNSPKChannel          : 1;        //0xEC
        uint16_t enterNSPKModeReq           : 1;        //0xF4
        uint16_t enterBroadcastModeReq      : 1;        //0xF5
        uint16_t MMI_F6_Req                 : 1;        //0xF6
        uint16_t MMI_F7_Req                 : 1;        //0xF7
    };
} NextMMIActionReq2;

//timer and request
/*struct {
    uint16_t ReqDisableDiscoverableTimer;
    //...
    union{
        uint16_t allReq;
        struct {
            uint16_t    ReqDisableDiscoverable  : 1;
            //...
        };
    };
} TimeCommandReq;*/

uint8_t BT_localBDAddr[6];
uint8_t BT_masterBDAddr[6];
uint8_t linkbackBDAddr[6];

typedef enum {
    A2DP = 0,
    HFP,
    LINE_IN,
    ALL_MODE = 0xff
} VOLUME_MODE;
#define ALL_MUTE		0xff
#define ALL_UNMUTE		0xfe

struct {
    uint8_t a2dpVol;
    uint8_t hfpVol;
    uint8_t lineInVol;
    VOLUME_MODE currentVolMode;
} BTAPP_Volume;

union {
    uint8_t PORT_1;
    struct{
        uint8_t PORT_1_0    : 1;
        uint8_t PORT_1_1    : 1;
        uint8_t PORT_1_2    : 1;
        uint8_t PORT_1_3    : 1;
        uint8_t PORT_1_4    : 1;
        uint8_t PORT_1_5    : 1;
        uint8_t PORT_1_6    : 1;
